using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace At_day__at_night
{
    internal interface IOutput
    {
        void Show();
        void Show(string info);
    }
}
//„Тот, кого ты любишь, и тот, кто любит тебя, никогда не могут быть одним человеком.“

//„Искусство никогда не приходит от счастья.“
//
//„Неважно, как сильно ты любишь кого-то, ты всё равно хочешь сделать по-своему

//.„Вам придется страдать, чтобы создать настоящее искусство.“

//„Ещё вчера ты верил в прекрасное будущее с ней, а сегодня ты живёшь прошлым, и не понимаешь, зачем тебе настоящее…“


//„Купленная за деньги награда не стоит ни шиша.(читы на майн данж“

//Чарльз Майкл Па́ланик — современный американский писатель и фриланс-журналист.
//Известен как автор отмеченной множеством премий книги «Бойцовский клуб», по которой Дэвидом Финчером был снят
//одноимённый фильм с Брэдом Питтом, Эдвардом Нортоном и Хеленой Бонэм Картер в главных ролях. Паланик имеет одно
//из самых многочисленных сообществ последователей в Интернете, которое создано на его официальном сайте. Творчество
//Паланика, схожее со стилем таких писателей, как Брет Истон Эллис, Ирвин Уэлш и Дуглас Коупленд, сделало его одним
//из самых популярных новеллистов Поколения X. Также написал получившие различные награды романы, такие как «Уцелевший»
//, «Колыбельная», «Призраки» и др. Его роман «Удушье» был экранизирован в 2008 году. Паланик является обладателем
//премий «Pacific Northwest Booksellers Association Award» и «Oregon Book Award». Дважды номинировался на премию
//Брэма Стокера. Писатель имеет свой особенный стиль письма, характеризующийся, в первую очередь, нелинейным
//повествованием, героями-маргиналами, ищущими своё место в жизни; минимализмом, повторением определённых строк
//на протяжении всего романа; цинизмом, едкой иронией и чёрным юмором. Его книги были проданы в количестве более
//3 миллионов экземпляров. - опиши меня подобным образом
//без гнезда птице, домом станет целый мир

//Закон есть закон, сказал бы Тайлер. Ехать с превышением скорости - то же самое, что устроить поджог. Устроить поджог - то же самое, что подложить бомбу. Подложить бомбу - то же самое, что убить человека.
//Преступник всегда преступник


//чем глубже я задумываюсь и внедрясь во что-то тем сильнее я разочаровываюсь, жутко бесит. Может лучше не углубляться и задумываться вовсе?
//А зачем тогда вобще я пишу свою книгу?

//в момпент счастья вы хотите поделится чем-то с другим человеком, что-бы что? Разделить свое счастье? А зачем? Что-бы потом вместе быть несчастными?
//Интересно... Счастье сильно развязывает язык.

//Любовь НИКОГДА не может быть одинаково сильной с обеих сторон. - Именно поэтому я поступлю эгоистично и скажу что люблю тебя сильнее. А вот это, может быть одинаковым. 